bajihahaha/-/RTthread_Blink_DeepSleep - 副本 (2)/Drivers/fm33a0xxev_cmu.h
/* CPU内核systick工作时钟选择 (Systick clock select)
00：SCLK
01：LSCLK
10：RC4M
11：SYSCLK 相关函数 */
extern void CMU_SYSCLKCR_STCLKSEL_Set(uint32_t SetValue);
extern uint32_t CMU_SYSCLKCR_STCLKSEL_Get(void);

/* 系统时钟源选择 相关函数 */
extern void CMU_SYSCLKCR_SYSCLKSEL_Set(uint32_t SetValue);
extern uint32_t CMU_SYSCLKCR_SYSCLKSEL_Get(void);

/* RCHF频率选择寄存器0000：8MHz
0001：16MHz
0010：24MHz
0011：32MHz
0111：40MHz
1111：48MHz
其他：RFU 相关函数 */
extern void CMU_RCHFCR_FSEL_Set(uint32_t SetValue);
extern uint32_t CMU_RCHFCR_FSEL_Get(void);

/* RCHF使能寄存器 (RCHF Enable)
1：使能RCHF
0：关闭RCHF 相关函数 */
extern void CMU_RCHFCR_RCHFEN_Setable(FunState NewState);
extern FunState CMU_RCHFCR_RCHFEN_Getable(void);

/* RCHF频率调校寄存器，8’h00表示频率最低，8’hFF表示频率最高，调校范围为中心频率+/-30%，调校步长为中心频率0.25%
上电后芯片自动从LDT0读取8MHz调校值并写入此寄存器
软件使用其他频率时，可以自行从LDT0指定地址读取调校信息并写入此寄存器，从而确保输出频率准确。 相关函数 */
extern void CMU_RCHFTR_RCHFTRIM_Set(uint32_t SetValue);
extern uint32_t CMU_RCHFTR_RCHFTRIM_Get(void);
extern FlagStatus CMU_PLLLCR_LOCKED_Chk(void);
extern void CMU_PLLLCR_PLLDB_Set(uint32_t SetValue);
extern uint32_t CMU_PLLLCR_PLLDB_Get(void);

/* PLL使能寄存器
1：使能PLL
0：关闭PLL 相关函数 */
extern void CMU_PLLLCR_PLLEN_Setable(FunState NewState);
extern FunState CMU_PLLLCR_PLLEN_Getable(void);

/* PLLH倍频比，参考时钟1Mhz
0000011111：输出32倍频
0101111：输出48倍频 相关函数 */
extern void CMU_PLLHCR_PLLHDB_Set(uint32_t SetValue);
extern uint32_t CMU_PLLHCR_PLLHDB_Get(void);

/* PLLH锁定标志，软件通过查询此寄存器确认PLL已经处于锁定状态
1：PLL已锁定
0：PLL未锁定 相关函数 */
extern FlagStatus CMU_PLLHCR_LOCKED_Chk(void);

/* PLLH参考时钟预分频（目标是产生1MHz参考时钟给PLL）
000：不分频
001：2分频
010：4分频
011：8分频
100：12分频
101：16分频
110：24分频
111：32分频 相关函数 */
extern void CMU_PLLHCR_REFPRSC_Set(uint32_t SetValue);
extern uint32_t CMU_PLLHCR_REFPRSC_Get(void);

/* PLLH输出选择寄存器
0：选择PLLH一倍输出作为数字电路内的PLL时钟
1：选择PLLH两倍输出作为数字电路内的PLL时钟 相关函数 */
extern void CMU_PLLHCR_OSEL_Set(uint32_t SetValue);
extern uint32_t CMU_PLLHCR_OSEL_Get(void);

/* PLLH输入选择寄存器
00/11：RCHF
01：PLL_L
10：XTHF 相关函数 */
extern void CMU_PLLHCR_INSEL_Set(uint32_t SetValue);
extern uint32_t CMU_PLLHCR_INSEL_Get(void);

/* PLLH使能寄存器
1：使能PLLH
0：关闭PLLH 相关函数 */
extern void CMU_PLLHCR_EN_Setable(FunState NewState);
extern FunState CMU_PLLHCR_EN_Getable(void);

/* XTHF振荡强度配置
000：最弱
111：最强 相关函数 */
extern void CMU_XTHFCR_XTHF_CFG_Set(uint32_t SetValue);
extern uint32_t CMU_XTHFCR_XTHF_CFG_Get(void);

/* XTHF使能寄存器
0：关闭XTHF
1：使能XTHF 相关函数 */
extern void CMU_XTHFCR_XTHFEN_Setable(FunState NewState);
extern FunState CMU_XTHFCR_XTHFEN_Getable(void);
extern void CMU_IER_SYSCSE_IE_Setable(FunState NewState);
extern FunState CMU_IER_SYSCSE_IE_Getable(void);
extern void CMU_IER_HFDET_IE_Setable(FunState NewState);
extern FunState CMU_IER_HFDET_IE_Getable(void);


/* 高频晶体停振检测模块输出
1：XTHF未停振
0：XTHF停振 相关函数 */
extern FlagStatus CMU_ISR_HFDETO_Chk(void);

/* 低频晶体停振检测模块输出
1：XTLF未停振
0：XTLF停振 相关函数 */
extern FlagStatus CMU_ISR_LFDETO_Chk(void);

/* SYSCLK时钟选择错误中断标志寄存器；当被选中的时钟源没有使能时，此中断标志置位，软件写1清零。 相关函数 */
extern void CMU_ISR_SYSCSE_IF_Clr(void);
extern FlagStatus CMU_ISR_SYSCSE_IF_Chk(void);

/* 高频停振检测中断标志寄存器，XTHF停振时硬件异步置位，软件写1清零；只有在FFDETO不为0的情况下才能够清除此寄存器 相关函数 */
extern void CMU_ISR_HFDET_IF_Clr(void);
extern FlagStatus CMU_ISR_HFDET_IF_Chk(void);

/* EXTI工作时钟使能，高有效 相关函数 */
extern void CMU_OPCCR1_EXTICKE_Setable(FunState NewState);
extern FunState CMU_OPCCR1_EXTICKE_Getable(void);

/* EXTI中断采样时钟选择 */
extern void CMU_OPCCR1_EXTICKSEL_Set(uint32_t SetValue);
extern uint32_t CMU_OPCCR1_EXTICKSEL_Get(void);

/* LPUART1工作时钟使能，高有效 相关函数 */
extern void CMU_OPCCR1_LPUART1CKE_Setable(FunState NewState);
extern FunState CMU_OPCCR1_LPUART1CKE_Getable(void);

/* LPUART0工作时钟使能，高有效 相关函数 */
extern void CMU_OPCCR1_LPUART0CKE_Setable(FunState NewState);
extern FunState CMU_OPCCR1_LPUART0CKE_Getable(void);

/* LPUART1工作时钟选择
00：LSCLK
01：RCHF分频（根据RCHF档位自动分频到32768Hz附近）
10：RFU
11：RFU 相关函数 */
extern void CMU_OPCCR1_LPUART1CKS_Set(uint32_t SetValue);
extern uint32_t CMU_OPCCR1_LPUART1CKS_Get(void);

/* LPUART0工作时钟选择
00：LSCLK
01：RCHF分频（根据RCHF档位自动分频到32768Hz附近）
10：RFU
11：RFU 相关函数 */
extern void CMU_OPCCR1_LPUART0CKS_Set(uint32_t SetValue);
extern uint32_t CMU_OPCCR1_LPUART0CKS_Get(void);

/* I2C1工作时钟使能 相关函数 */
extern void CMU_OPCCR1_I2C1CKE_Setable(FunState NewState);
extern FunState CMU_OPCCR1_I2C1CKE_Getable(void);

/* I2C0工作时钟使能 相关函数 */
extern void CMU_OPCCR1_I2C0CKE_Setable(FunState NewState);
extern FunState CMU_OPCCR1_I2C0CKE_Getable(void);

/* I2C1主机工作时钟选择
00：APBCLK
01：RCHF
10：SYSCLK
11：APBCLK 相关函数 */
extern void CMU_OPCCR1_I2C1CKS_Set(uint32_t SetValue);
extern uint32_t CMU_OPCCR1_I2C1CKS_Get(void);


/* I2C0主机工作时钟选择
00：APBCLK
01：RCHF
10：SYSCLK
11：APBCLK 相关函数 */
extern void CMU_OPCCR1_I2C0CKS_Set(uint32_t SetValue);
extern uint32_t CMU_OPCCR1_I2C0CKS_Get(void);

/* UART1工作时钟使能，高有效 相关函数 */
extern void CMU_OPCCR1_UART1CKE_Setable(FunState NewState);
extern FunState CMU_OPCCR1_UART1CKE_Getable(void);

/* UART0工作时钟使能，高有效 相关函数 */
extern void CMU_OPCCR1_UART0CKE_Setable(FunState NewState);
extern FunState CMU_OPCCR1_UART0CKE_Getable(void);

/* UART1工作时钟选择
00：APBCLK
01：RCHF
10：SYSCLK
11：RFU 相关函数 */
extern void CMU_OPCCR1_UART1CKS_Set(uint32_t SetValue);
extern uint32_t CMU_OPCCR1_UART1CKS_Get(void);

/* UART0工作时钟选择
00：APBCLK
01：RCHF
10：SYSCLK
11：RFU 相关函数 */
extern void CMU_OPCCR1_UART0CKS_Set(uint32_t SetValue);
extern uint32_t CMU_OPCCR1_UART0CKS_Get(void);

/* 随机数发生器工作时钟分频
000：不分频
001：2分频
010：4分频
011：8分频
100：16分频
101：32分频
110, 111：RFU 相关函数 */
extern void CMU_OPCCR2_RNGPRSC_Set(uint32_t SetValue);
extern uint32_t CMU_OPCCR2_RNGPRSC_Get(void);

/* Flash擦写时钟使能，高有效 相关函数 */
extern void CMU_OPCCR2_NVMCKE_Setable(FunState NewState);
extern FunState CMU_OPCCR2_NVMCKE_Getable(void);

/* 随机数发生器工作时钟使能，高有效 相关函数 */
extern void CMU_OPCCR2_RNGCKE_Setable(FunState NewState);
extern FunState CMU_OPCCR2_RNGCKE_Getable(void);

/*  _工作时钟使能，高有效 相关函数 */
extern void CMU_OPCCR2_LPTCKE_Setable(FunState NewState);
extern FunState CMU_OPCCR2_LPTCKE_Getable(void);

/*  _工作时钟选择
00：APBCLK
01：LSCLK
10：RCLP
11：PLL_L 相关函数 */
extern void CMU_OPCCR2_LPTCKS_Set(uint32_t SetValue);
extern uint32_t CMU_OPCCR2_LPTCKS_Get(void);

/* BSTIM工作时钟使能，高有效 相关函数 */
extern void CMU_OPCCR2_BSTCKE_Setable(FunState NewState);
extern FunState CMU_OPCCR2_BSTCKE_Getable(void);

