bajihahaha/-/RTthread_Blink_DeepSleep - 副本 (2)/Drivers/fm33a0xxev_cmu.h
/* BSTIM工作时钟源选择
00：APBCLK
01：LSCLK
10：RCLP
11：SYSCLK 相关函数 */
extern void CMU_OPCCR2_BSTCKS_Set(uint32_t SetValue);
extern uint32_t CMU_OPCCR2_BSTCKS_Get(void);
//Announce_End

/* 获取芯片已设置的不同时钟频率函数 */
extern void CMU_GetClocksFreq(CMU_ClocksType* para);

/* RCHF初始化函数 */
extern void CMU_RCHF_Init(CMU_RCHF_InitTypeDef* para);

/* PLL H初始化函数 */
void CMU_PLL_H_Init(CMU_PLL_H_InitTypeDef* para);

/* rchf常温校准值载入函数 */
extern void CMU_Init_RCHF_Trim( uint8_t ClkMode );

/* 系统时钟初始化 */
extern void CMU_SysClk_Init(CMU_SYSCLK_InitTypeDef* para);

/* 外设时钟控制参数定义 */
#define	COMPCLK		    (0x01000000 + CMU_PCLKCR1_COMP_PCE_Pos)	//9	/* COMP总线时钟使能，高使能 */
#define	SVDCLK		    (0x01000000 + CMU_PCLKCR1_SVD_PCE_Pos)	//8	/* SVD总线时钟使能，高使能 */
#define	PADCLK			(0x01000000 + CMU_PCLKCR1_PAD_PCE_Pos)	//7	/* PADCFG总线时钟使能，高使能 */
#define	ANACCLK			(0x01000000 + CMU_PCLKCR1_ANAC_PCE_Pos)	//6	/* ANAC总线时钟使能，高使能此寄存器用于控制SVD、比较器的总线时钟 */
#define	IWDTCLK			(0x01000000 + CMU_PCLKCR1_IWDT_PCE_Pos)	//5	/* IWDT总线时钟使能，高使能 */
#define	SCUCLK			(0x01000000 + CMU_PCLKCR1_SCU_PCE_Pos)	//4	/* SCU总线时钟使能，高使能 */
#define	PMUCLK			(0x01000000 + CMU_PCLKCR1_PMU_PCE_Pos)	//3	/* PMU总线时钟使能，高使能 */
#define	RTCCLK			(0x01000000 + CMU_PCLKCR1_RTC_PCE_Pos)	//2	/* RTC总线时钟使能，高使能 */
#define	LPTCLK			(0x01000000 + CMU_PCLKCR1_LPT_PCE_Pos)	//0	/* LPTIM总线时钟使能，高使能 */
        

#define	PAECLK			(0x02000000 + CMU_PCLKCR2_PAE_PCE_Pos)	//17	/* PAE总线时钟使能，高使能 */
#define	SHACLK			(0x02000000 + CMU_PCLKCR2_SHA_PCE_Pos)	//16	/* SHA总线时钟使能，高使能 */
#define	CICCLK			(0x02000000 + CMU_PCLKCR2_CIC_PCE_Pos)	//8	  /* CIC总线时钟使能，高使能 */
#define	WWDTCLK			(0x02000000 + CMU_PCLKCR2_WWDT_PCE_Pos)	//7	/* WWDT时钟使能，高使能 */
#define	RAMBISTCLK	    (0x02000000 + CMU_PCLKCR2_RAMBIST_PCE_Pos)	//6	/* RAMBIST时钟使能，高使能 */
#define	FLASHCLK		(0x02000000 + CMU_PCLKCR2_NVM_PCE_Pos)	//5	/* FLSC（Flash擦写控制器）时钟使能，高使能 */
#define	DMACLK			(0x02000000 + CMU_PCLKCR2_DMA_PCE_Pos)	//4	/* DMA时钟使能，高使能 */
#define	LCDCLK			(0x02000000 + CMU_PCLKCR2_LCD_PCE_Pos)	//3	/* LCD时钟使能，高使能 */
#define	AESCLK			(0x02000000 + CMU_PCLKCR2_AES_PCE_Pos)	//2	/* AES时钟使能，高使能 */
#define	TRNGCLK			(0x02000000 + CMU_PCLKCR2_TRNG_PCE_Pos)	//1	/* RNG时钟使能，高使能 */
#define	CRCCLK			(0x02000000 + CMU_PCLKCR2_CRC_PCE_Pos)	//0	/* CRC时钟使能，高使能 */

#define	I2C1CLK			(0x03000000 + CMU_PCLKCR3_I2C1_PCE_Pos)	//25	/* I2C1时钟使能 */
#define	I2C0CLK			(0x03000000 + CMU_PCLKCR3_I2C0_PCE_Pos)	//24	/* I2C0时钟使能 */
#define	LPUART1CLK	    (0x03000000 + CMU_PCLKCR3_LPUART1_PCE_Pos)	//18	/* LPUART1功能时钟使能 */
#define	U7816CLK		(0x03000000 + CMU_PCLKCR3_U7816_PCE_Pos)	//16	/* U7816-0时钟使能 */
#define	LPUART0CLK	    (0x03000000 + CMU_PCLKCR3_LPUART0_PCE_Pos)	//15	/* LPUART0寄存器总线时钟使能 */
#define	UARTIRCLK	    (0x03000000 + CMU_PCLKCR3_UICR_PCE_Pos)	//14	/* UART红外总线使能，高使能*/
#define	UART5CLK		(0x03000000 + CMU_PCLKCR3_UART5_PCE_Pos)	//13	/* UART5时钟使能 */
#define	UART4CLK		(0x03000000 + CMU_PCLKCR3_UART4_PCE_Pos)	//12	/* UART4时钟使能 */
#define	UART3CLK		(0x03000000 + CMU_PCLKCR3_UART3_PCE_Pos)	//11	/* UART3时钟使能 */
#define	UART2CLK		(0x03000000 + CMU_PCLKCR3_UART2_PCE_Pos)	//10	/* UART2时钟使能 */
#define	UART1CLK		(0x03000000 + CMU_PCLKCR3_UART1_PCE_Pos)	//9	/* UART1时钟使能 */
#define	UART0CLK		(0x03000000 + CMU_PCLKCR3_UART0_PCE_Pos)	//8	/* UART0时钟使能 */
#define	QSPICLK			(0x03000000 + CMU_PCLKCR3_QSPI_PCE_Pos)	//7	/* QSPI总线时钟使能 */
#define	SPI4CLK			(0x03000000 + CMU_PCLKCR3_SPI4_PCE_Pos)	//4	/* SPI4时钟使能 */
#define	SPI3CLK			(0x03000000 + CMU_PCLKCR3_SPI3_PCE_Pos)	//3	/* SPI3时钟使能 */
#define	SPI2CLK			(0x03000000 + CMU_PCLKCR3_SPI2_PCE_Pos)	//2	/* SPI2时钟使能 */
#define	SPI1CLK			(0x03000000 + CMU_PCLKCR3_SPI1_PCE_Pos)	//1	/* SPI1时钟使能 */
#define	SPI0CLK			(0x03000000 + CMU_PCLKCR3_SPI0_PCE_Pos)	//0	/* SPI0时钟使能 */


#define	ET4CLK			(0x04000000 + CMU_PCLKCR4_ET4_PCE_Pos)	//6	/* Etimer4时钟使能，高使能 */
#define	ET3CLK			(0x04000000 + CMU_PCLKCR4_ET3_PCE_Pos)	//5	/* Etimer3时钟使能，高使能 */
#define	ET2CLK			(0x04000000 + CMU_PCLKCR4_ET2_PCE_Pos)	//4	/* Etimer2时钟使能，高使能 */
#define	ET1CLK			(0x04000000 + CMU_PCLKCR4_ET1_PCE_Pos)	//3	/* Etimer1时钟使能，高使能 */
#define	BT2CLK			(0x04000000 + CMU_PCLKCR4_BT2_PCE_Pos)	//2	/* BaseTimer2时钟使能，高使能 */
#define	BT1CLK			(0x04000000 + CMU_PCLKCR4_BT1_PCE_Pos)	//1	/* BaseTimer1时钟使能，高使能 */
#define	BSTIMCLK	    (0x04000000 + CMU_PCLKCR4_BSTIM_PCE_Pos)	//0	/* 基本定时器BSTIM总线时钟使能，高使能 */

/* 外设时钟使能函数 */
extern void CMU_PERCLK_SetableEx(uint32_t periph_def, FunState NewState);
#ifdef __cplusplus
}
#endif

#endif /* __FM33A0XXEV_CMU_H */
